app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "introduction" = ? WHERE "users"."id" = ?  [["updated_at", "2022-05-24 16:32:35.493903"], ["introduction", "hey!"], ["id", 1]]